module Transition.Concur.Cofinal.Lattice.Helpers.nu-propagate-c-c where

   open import ConcurrentSlicingCommon
   import Ren as ᴿ
   open import Transition.Concur.Cofinal.Lattice.Common

   private
      wibble : ∀ {Γ P₀ R₀ R′₀} {a a′ : Actionᶜ Γ} {E : P₀ —[ (ᴿ.push *) a ᶜ - _ ]→ R₀} {E′ : P₀ —[ (ᴿ.push *) a′ ᶜ - _ ]→ R′₀}
               (𝐸 : E ⌣₁[ ᶜ∇ᶜ ] E′) (P : ↓ P₀) (R : ↓ R₀) (R′ : ↓ R′₀) (S : ↓ tgt₁ (⊖₁ 𝐸)) (S′ : ↓ tgt₂ (⊖₁ 𝐸)) →
               tgt E P ≡ R → tgt E′ P ≡ R′ → tgt (E′/E (⊖₁ 𝐸)) R ≡ S → tgt (E/E′ (⊖₁ 𝐸)) R′ ≡ S′ →
               braiding (ᶜ∇ᶜ {a = (ᴿ.push *) a} {(ᴿ.push *) a′}) {0} (γ₁ 𝐸) (tgt (E′/E (⊖₁ 𝐸)) (tgt E P)) ≡
               tgt (E/E′ (⊖₁ 𝐸)) (tgt E′ P) →
               braiding (ᶜ∇ᶜ {a = a} {a′}) {0} (cong ν_ (γ₁ 𝐸))
               [ ν S ] ≡ [ ν S′ ]
      wibble {a = a} {a′} {E} {E′} 𝐸 P R R′ S S′ ≡R ≡R′ ≡S ≡S′ IH =
         let α : S ≅ S′
             α = let open ≅-Reasoning in
                begin
                   S
                ≡⟨ sym ≡S ⟩
                   tgt (E′/E (⊖₁ 𝐸)) R
                ≡⟨ cong (tgt (E′/E (⊖₁ 𝐸))) (sym ≡R) ⟩
                   tgt (E′/E (⊖₁ 𝐸)) (tgt E P)
                ≅⟨ ≅-sym (reduce-ᶜ∇ᶜ (γ₁ 𝐸) _) ⟩
                   braiding (ᶜ∇ᶜ {a = (ᴿ.push *) a} {(ᴿ.push *) a′}) {0} (γ₁ 𝐸) (tgt (E′/E (⊖₁ 𝐸)) (tgt E P))
                ≡⟨ IH ⟩
                   tgt (E/E′ (⊖₁ 𝐸)) (tgt E′ P)
                ≡⟨ cong (tgt (E/E′ (⊖₁ 𝐸))) ≡R′ ⟩
                   tgt (E/E′ (⊖₁ 𝐸)) R′
                ≡⟨ ≡S′ ⟩
                   S′
                ∎
             open ≅-Reasoning in ≅-to-≡ (
         begin
            braiding ᶜ∇ᶜ (cong ν_ (γ₁ 𝐸)) [ ν S ]
         ≅⟨ reduce-ᶜ∇ᶜ (cong ν_ (γ₁ 𝐸)) _  ⟩
            [ ν S ]
         ≅⟨ [ν-]-cong (γ₁ 𝐸) α ⟩
            [ ν S′ ]
         ∎)

   module •x〈y〉-•x〈y〉
      {Γ P₀ R₀ R′₀} {x y x′ y′ : Name Γ} {E : P₀ —[ • ᴿ.push x 〈 ᴿ.push y 〉 ᶜ - _ ]→ R₀}
      {E′ : P₀ —[ • ᴿ.push x′ 〈 ᴿ.push y′ 〉 ᶜ - _ ]→ R′₀} (𝐸 : E ⌣₁[ ᶜ∇ᶜ ] E′) (P : ↓ P₀)
      (let P′₀ = tgt₁ (⊖₁ 𝐸); P″₀ = tgt₂ (⊖₁ 𝐸))
      (IH : braiding (ᶜ∇ᶜ {a = • ᴿ.push x 〈 ᴿ.push y 〉} {• ᴿ.push x′ 〈 ᴿ.push y′ 〉}) {0} (γ₁ 𝐸)
            (tgt (E′/E (⊖₁ 𝐸)) (tgt E P)) ≡ tgt (E/E′ (⊖₁ 𝐸)) (tgt E′ P))
      where

      module sub
         (R : ↓ R₀) (R′ : ↓ R′₀) (≡R : tgt E P ≡ R) (≡R′ : tgt E′ P ≡ R′) where

         case′ :
            braiding (ᶜ∇ᶜ {a = • x 〈 y 〉} {• x′ 〈 y′ 〉}) {0} (cong ν_ (γ₁ 𝐸))
            (π₂ (step⁻ (νᶜ E′/E (⊖₁ 𝐸)) (ν R))) ≡
            π₂ (step⁻ (νᶜ E/E′ (⊖₁ 𝐸)) (ν R′))
         case′
            with step (E′/E (⊖₁ 𝐸)) R | step (E/E′ (⊖₁ 𝐸)) R′ |
                 inspect (step (E′/E (⊖₁ 𝐸))) R | inspect (step (E/E′ (⊖₁ 𝐸))) R′
         case′ | ◻ , P′ | ◻ , P″ | [ ≡P′ ] | [ ≡P″ ] =
            wibble 𝐸 P R R′ P′ P″ ≡R ≡R′ (,-inj₂ ≡P′) (,-inj₂ ≡P″) IH
         case′ | ◻ , P′ | [ • ._ 〈 ◻ 〉 ᶜ ] , P″ | [ ≡P′ ] | [ ≡P″ ] =
            wibble 𝐸 P R R′ P′ P″ ≡R ≡R′ (,-inj₂ ≡P′) (,-inj₂ ≡P″) IH
         case′ | ◻ , P′ | [ • ._ 〈 [ ._ ] 〉 ᶜ ] , P″ | [ ≡P′ ] | [ ≡P″ ] =
            wibble 𝐸 P R R′ P′ P″ ≡R ≡R′ (,-inj₂ ≡P′) (,-inj₂ ≡P″) IH
         case′ | [ • ._ 〈 ◻ 〉 ᶜ ] , P′ | ◻ , P″ | [ ≡P′ ] | [ ≡P″ ] =
            wibble 𝐸 P R R′ P′ P″ ≡R ≡R′ (,-inj₂ ≡P′) (,-inj₂ ≡P″) IH
         case′ | [ • ._ 〈 [ ._ ] 〉 ᶜ ] , P′ | ◻ , P″ | [ ≡P′ ] | [ ≡P″ ] =
            wibble 𝐸 P R R′ P′ P″ ≡R ≡R′ (,-inj₂ ≡P′) (,-inj₂ ≡P″) IH
         case′ | [ • ._ 〈 ◻ 〉 ᶜ ] , P′ | [ • ._ 〈 ◻ 〉 ᶜ ] , P″ | [ ≡P′ ] | [ ≡P″ ] =
            wibble 𝐸 P R R′ P′ P″ ≡R ≡R′ (,-inj₂ ≡P′) (,-inj₂ ≡P″) IH
         case′ | [ • ._ 〈 ◻ 〉 ᶜ ] , P′ | [ • ._ 〈 [ ._ ] 〉 ᶜ ] , P″ | [ ≡P′ ] | [ ≡P″ ] =
            wibble 𝐸 P R R′ P′ P″ ≡R ≡R′ (,-inj₂ ≡P′) (,-inj₂ ≡P″) IH
         case′ | [ • ._ 〈 [ ._ ] 〉 ᶜ ] , P′ | [ • ._ 〈 ◻ 〉 ᶜ ] , P″ | [ ≡P′ ] | [ ≡P″ ] =
            wibble 𝐸 P R R′ P′ P″ ≡R ≡R′ (,-inj₂ ≡P′) (,-inj₂ ≡P″) IH
         case′ | [ • ._ 〈 [ ._ ] 〉 ᶜ ] , P′ | [ • ._ 〈 [ ._ ] 〉 ᶜ ] , P″ | [ ≡P′ ] | [ ≡P″ ] =
            wibble 𝐸 P R R′ P′ P″ ≡R ≡R′ (,-inj₂ ≡P′) (,-inj₂ ≡P″) IH

      open sub

      case :
         braiding (ᶜ∇ᶜ {a = • x 〈 y 〉} {• x′ 〈 y′ 〉}) {0} (cong ν_ (γ₁ 𝐸))
         (tgt (νᶜ E′/E (⊖₁ 𝐸)) (tgt (νᶜ E) [ ν P ])) ≡
         tgt (νᶜ E/E′ (⊖₁ 𝐸)) (tgt (νᶜ E′) [ ν P ])
      case
         with step E′ P | step E P | inspect (step E′) P | inspect (step E) P
      ... | ◻ , R′ | ◻ , R | [ ≡R′ ] | [ ≡R ] =
         case′ R R′ (,-inj₂ ≡R) (,-inj₂ ≡R′)
      ... | ◻ , R′ | [ • ._ 〈 ◻ 〉 ᶜ ] , R | [ ≡R′ ] | [ ≡R ] =
         case′ R R′ (,-inj₂ ≡R) (,-inj₂ ≡R′)
      ... | ◻ , R′ | [ • ._ 〈 [ ._ ] 〉 ᶜ ] , R | [ ≡R′ ] | [ ≡R ] =
         case′ R R′ (,-inj₂ ≡R) (,-inj₂ ≡R′)
      ... | [ • ._ 〈 ◻ 〉 ᶜ ] , R′ | ◻ , R | [ ≡R′ ] | [ ≡R ] =
         case′ R R′ (,-inj₂ ≡R) (,-inj₂ ≡R′)
      ... | [ • ._ 〈 [ ._ ] 〉 ᶜ ] , R′ | ◻ , R | [ ≡R′ ] | [ ≡R ] =
         case′ R R′ (,-inj₂ ≡R) (,-inj₂ ≡R′)
      ... | [ • ._ 〈 ◻ 〉 ᶜ ] , R′ | [ • ._ 〈 ◻ 〉 ᶜ ] , R | [ ≡R′ ] | [ ≡R ] =
         case′ R R′ (,-inj₂ ≡R) (,-inj₂ ≡R′)
      ... | [ • ._ 〈 ◻ 〉 ᶜ ] , R′ | [ • ._ 〈 [ ._ ] 〉 ᶜ ] , R | [ ≡R′ ] | [ ≡R ] =
         case′ R R′ (,-inj₂ ≡R) (,-inj₂ ≡R′)
      ... | [ • ._ 〈 [ ._ ] 〉 ᶜ ] , R′ | [ • ._ 〈 ◻ 〉 ᶜ ] , R | [ ≡R′ ] | [ ≡R ] =
         case′ R R′ (,-inj₂ ≡R) (,-inj₂ ≡R′)
      ... | [ • ._ 〈 [ ._ ] 〉 ᶜ ] , R′ | [ • ._ 〈 [ ._ ] 〉 ᶜ ] , R | [ ≡R′ ] | [ ≡R ] =
         case′ R R′ (,-inj₂ ≡R) (,-inj₂ ≡R′)
